resources/e2eTestData.json

{
    "payments": {
        "insertPayment": {
            "title": "string",
            "description": "string",
            "initialPaymentAmount": 23,
            "amount": 43,
            "currency": "string",
            "numberOfPayments": 5,
            "typeID": 1,
            "frequency": 10,
            "networkID": 3
        },
        "updatePayment": {
            "id": "63c684fe-8a97-11e8-b99f-9f38301a1e03",
            "title": "string",
            "description": "string",
            "promo": "string",
            "initialPaymentAmount": 23,
            "amount": 43,
            "currency": "string",
            "numberOfPayments": 5,
            "typeID": 1,
            "frequency": 10,
            "networkID": 3
        }
    },
    "contracts": {
        "updateContract": {
            "id": "63c684fe-8a97-11e8-b99f-9f38301a1e03",
            "title": "string",
            "description": "string",
            "promo": "string",
            "status": 1,
            "customerAddress": "string",
            "initialPaymentAmount": 23,
            "amount": 43,
            "currency": "string",
            "startTimestamp": 10,
            "endTimestamp": 13,
            "numberOfPayments": 5,
            "nextPaymentDate": "123456789",
            "lastPaymentDate": "123456789",
            "typeID": 1,
            "frequency": 10,
            "registerTxHash": "string",
            "registerTxStatus": 1,
            "executeTxHash": "string",
            "executeTxStatus": 1,
            "cancelTxHash": "string",
            "cancelTxStatus": 1,
            "initialPaymentTxHash": "string",
            "initialPaymentTxStatus": 1,
            "merchantAddress": "string",
            "pullPaymentAddress": "string",
            "userID": "string",
            "networkID": 3
        }
    }
}